// export const API_IMOEX = 'https://iss.moex.com/iss/statistics/engines/stock/markets/index/analytics/IMOEX.json?limit=100';
// export const API_SECURITIES = 'https://iss.moex.com/iss/engines/stock/markets/shares/boards/TQBR/securities.json';

export const API: string[] = [
	'https://iss.moex.com/iss/statistics/engines/stock/markets/index/analytics/IMOEX.json?limit=100', 'https://iss.moex.com/iss/engines/stock/markets/shares/boards/TQBR/securities.json'
]




// const test: Json = {
// 	"analytics": {
// 		"metadata": {
// 			"indexid": {
// 				"type": "string",
// 				"bytes": 36,
// 				"max_size": 0
// 			},
// 			"tradedate": {
// 				"type": "date",
// 				"bytes": 10,
// 				"max_size": 0
// 			},
// 			"ticker": {
// 				"type": "string",
// 				"bytes": 36,
// 				"max_size": 0
// 			},
// 			"shortnames": {
// 				"type": "string",
// 				"bytes": 189,
// 				"max_size": 0
// 			},
// 			"secids": {
// 				"type": "string",
// 				"bytes": 36,
// 				"max_size": 0
// 			},
// 			"weight": {
// 				"type": "double"
// 			},
// 			"tradingsession": {
// 				"type": "int32"
// 			}
// 		},
// 		"columns": [
// 			"indexid",
// 			"tradedate",
// 			"ticker",
// 			"shortnames",
// 			"secids",
// 			"weight",
// 			"tradingsession"
// 		],
// 		"data": [
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"AFKS",
// 				"Система ао",
// 				"AFKS",
// 				0.62,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"AFLT",
// 				"Аэрофлот",
// 				"AFLT",
// 				0.78,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"AGRO",
// 				"AGRO-гдр",
// 				"AGRO",
// 				0.79,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"ALRS",
// 				"АЛРОСА ао",
// 				"ALRS",
// 				1.04,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"BSPB",
// 				"БСП ао",
// 				"BSPB",
// 				0.51,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"CBOM",
// 				"МКБ ао",
// 				"CBOM",
// 				0.62,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"CHMF",
// 				"СевСт-ао",
// 				"CHMF",
// 				1.96,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"ENPG",
// 				"ЭН+ГРУП ао",
// 				"ENPG",
// 				0.34,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"FEES",
// 				"Россети",
// 				"FEES",
// 				0.38,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"FIVE",
// 				"FIVE-гдр",
// 				"FIVE",
// 				1.22,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"FLOT",
// 				"Совкомфлот",
// 				"FLOT",
// 				0.51,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"GAZP",
// 				"ГАЗПРОМ ао",
// 				"GAZP",
// 				11.4,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"GLTR",
// 				"GLTR-гдр",
// 				"GLTR",
// 				0.29,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"GMKN",
// 				"ГМКНорНик",
// 				"GMKN",
// 				4.07,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"HYDR",
// 				"РусГидро",
// 				"HYDR",
// 				0.22,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"IRAO",
// 				"ИнтерРАОао",
// 				"IRAO",
// 				1.5,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"LEAS",
// 				"Европлан",
// 				"LEAS",
// 				0.22,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"LKOH",
// 				"ЛУКОЙЛ",
// 				"LKOH",
// 				16,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"MAGN",
// 				"ММК",
// 				"MAGN",
// 				1.19,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"MGNT",
// 				"Магнит ао",
// 				"MGNT",
// 				1.23,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"MOEX",
// 				"МосБиржа",
// 				"MOEX",
// 				1.25,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"MSNG",
// 				"+МосЭнерго",
// 				"MSNG",
// 				0.28,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"MTLR",
// 				"Мечел ао",
// 				"MTLR",
// 				0.23,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"MTLRP",
// 				"Мечел ап",
// 				"MTLRP",
// 				0.15,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"MTSS",
// 				"МТС-ао",
// 				"MTSS",
// 				1.02,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"NLMK",
// 				"НЛМК ао",
// 				"NLMK",
// 				1.54,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"NVTK",
// 				"Новатэк ао",
// 				"NVTK",
// 				3.73,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"OZON",
// 				"OZON-адр",
// 				"OZON",
// 				1.42,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"PHOR",
// 				"ФосАгро ао",
// 				"PHOR",
// 				0.69,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"PIKK",
// 				"ПИК ао",
// 				"PIKK",
// 				1.39,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"PLZL",
// 				"Полюс",
// 				"PLZL",
// 				3.1,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"POSI",
// 				"iПозитив",
// 				"POSI",
// 				0.76,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"ROSN",
// 				"Роснефть",
// 				"ROSN",
// 				2.36,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"RTKM",
// 				"Ростел -ао",
// 				"RTKM",
// 				1.03,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"RUAL",
// 				"РУСАЛ ао",
// 				"RUAL",
// 				1.17,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"SBER",
// 				"Сбербанк",
// 				"SBER",
// 				12.34,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"SBERP",
// 				"Сбербанк-п",
// 				"SBERP",
// 				2.38,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"SELG",
// 				"Селигдар",
// 				"SELG",
// 				0.27,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"SGZH",
// 				"Сегежа",
// 				"SGZH",
// 				0.1,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"SMLT",
// 				"Самолет ао",
// 				"SMLT",
// 				0.2,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"SNGS",
// 				"Сургнфгз",
// 				"SNGS",
// 				3.07,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"SNGSP",
// 				"Сургнфгз-п",
// 				"SNGSP",
// 				2.95,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"TATN",
// 				"Татнфт 3ао",
// 				"TATN",
// 				6.91,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"TATNP",
// 				"Татнфт 3ап",
// 				"TATNP",
// 				1.27,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"TCSG",
// 				"ТКСХолд ао",
// 				"TCSG",
// 				3.21,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"TRNFP",
// 				"Транснф ап",
// 				"TRNFP",
// 				0.63,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"UPRO",
// 				"Юнипро ао",
// 				"UPRO",
// 				0.27,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"VKCO",
// 				"МКПАО \"ВК\"",
// 				"VKCO",
// 				0.6,
// 				3
// 			],
// 			[
// 				"IMOEX",
// 				"2024-09-17",
// 				"VTBR",
// 				"ВТБ ао",
// 				"VTBR",
// 				0.8,
// 				3
// 			]
// 		]
// 	},
// 	"analytics.cursor": {
// 		"metadata": {
// 			"INDEX": {
// 				"type": "int64"
// 			},
// 			"TOTAL": {
// 				"type": "int64"
// 			},
// 			"PAGESIZE": {
// 				"type": "int64"
// 			},
// 			"PREV_DATE": {
// 				"type": "string",
// 				"bytes": 30,
// 				"max_size": 0
// 			},
// 			"NEXT_DATE": {
// 				"type": "undefined",
// 				"bytes": 0,
// 				"max_size": 0
// 			}
// 		},
// 		"columns": [
// 			"INDEX",
// 			"TOTAL",
// 			"PAGESIZE",
// 			"PREV_DATE",
// 			"NEXT_DATE"
// 		],
// 		"data": [
// 			[
// 				0,
// 				49,
// 				100,
// 				"2024-09-16",
// 				null
// 			]
// 		]
// 	},
// 	"analytics.dates": {
// 		"metadata": {
// 			"from": {
// 				"type": "date",
// 				"bytes": 30,
// 				"max_size": 0
// 			},
// 			"till": {
// 				"type": "date",
// 				"bytes": 30,
// 				"max_size": 0
// 			}
// 		},
// 		"columns": [],
// 		"data": [
// 			[
// 				"2001-01-03",
// 				"2024-09-17"
// 			]
// 		]
// 	}
// }